Revit 2024 API
StructuralSettings.SymbolicCutbackForColumn Property
 Symbolic cutback distance to be applied to all columns.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double SymbolicCutbackForColumn { get; set; }
Visual Basic
Public Property SymbolicCutbackForColumn As Double
	Get
	Set
Visual C++
public:
property double SymbolicCutbackForColumn {
	double get ();
	void set (double value);
}
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace